OpenFOAM/benchmark_cases_LiPb/k-epsilon-turbulent-case/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.215e-07;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2.215e-07;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 2.215e-07;
    }
    probe
    {
        type            kqRWallFunction;
        value           uniform 2.215e-07;
    }
}

